grevaillot/svd_tools/headers/STM32H750x/sdmmc2.h
/** SDMMC2_SDMMC_CMDR_CMDSTOP The CPSM treats the command as a Stop Transmission command and signals Abort to the DPSM. This bit can only be written by firmware when CPSM is disabled (CPSMEN = 0). If this bit is set, the CPSM issues the Abort signal to the DPSM when the command is sent. **/
#define SDMMC2_SDMMC_CMDR_CMDSTOP		(1 << 7)
/** SDMMC2_SDMMC_CMDR_CMDTRANS The CPSM treats the command as a data transfer command, stops the interrupt period, and signals DataEnable to the DPSM This bit can only be written by firmware when CPSM is disabled (CPSMEN = 0). If this bit is set, the CPSM issues an end of interrupt period and issues DataEnable signal to the DPSM when the command is sent. **/
#define SDMMC2_SDMMC_CMDR_CMDTRANS		(1 << 6)

#define SDMMC2_SDMMC_CMDR_CMDINDEX_SHIFT		0
#define SDMMC2_SDMMC_CMDR_CMDINDEX_MASK		0x3f
/** @defgroup sdmmc2_sdmmc_cmdr_cmdindex CMDINDEX Command index. This bit can only be written by firmware when CPSM is disabled (CPSMEN = 0). The command index is sent to the card as part of a command message.
@{*/
/**@}*/


/**@}*/

/** @defgroup sdmmc2_sdmmc_respcmdr SDMMCRESPCMDR SDMMC command response register
@{*/


#define SDMMC2_SDMMC_RESPCMDR_RESPCMD_SHIFT		0
#define SDMMC2_SDMMC_RESPCMDR_RESPCMD_MASK		0x3f
/** @defgroup sdmmc2_sdmmc_respcmdr_respcmd RESPCMD Response command index
@{*/
/**@}*/


/**@}*/

/** @defgroup sdmmc2_sdmmc_resp1r SDMMCRESP1R The SDMMC_RESP1/2/3/4R registers contain the status of a card, which is part of the received response.
@{*/


#define SDMMC2_SDMMC_RESP1R_CARDSTATUS1_SHIFT		0
#define SDMMC2_SDMMC_RESP1R_CARDSTATUS1_MASK		0xffffffff
/** @defgroup sdmmc2_sdmmc_resp1r_cardstatus1 CARDSTATUS1 see Table 432
@{*/
/**@}*/


/**@}*/

/** @defgroup sdmmc2_sdmmc_resp2r SDMMCRESP2R The SDMMC_RESP1/2/3/4R registers contain the status of a card, which is part of the received response.
@{*/


#define SDMMC2_SDMMC_RESP2R_CARDSTATUS2_SHIFT		0
#define SDMMC2_SDMMC_RESP2R_CARDSTATUS2_MASK		0xffffffff
/** @defgroup sdmmc2_sdmmc_resp2r_cardstatus2 CARDSTATUS2 see Table404.
@{*/
/**@}*/


/**@}*/

/** @defgroup sdmmc2_sdmmc_resp3r SDMMCRESP3R The SDMMC_RESP1/2/3/4R registers contain the status of a card, which is part of the received response.
@{*/


#define SDMMC2_SDMMC_RESP3R_CARDSTATUS3_SHIFT		0
#define SDMMC2_SDMMC_RESP3R_CARDSTATUS3_MASK		0xffffffff
/** @defgroup sdmmc2_sdmmc_resp3r_cardstatus3 CARDSTATUS3 see Table404.
@{*/
/**@}*/


/**@}*/

/** @defgroup sdmmc2_sdmmc_resp4r SDMMCRESP4R The SDMMC_RESP1/2/3/4R registers contain the status of a card, which is part of the received response.
@{*/


#define SDMMC2_SDMMC_RESP4R_CARDSTATUS4_SHIFT		0
#define SDMMC2_SDMMC_RESP4R_CARDSTATUS4_MASK		0xffffffff
/** @defgroup sdmmc2_sdmmc_resp4r_cardstatus4 CARDSTATUS4 see Table404.
@{*/
/**@}*/


/**@}*/

/** @defgroup sdmmc2_sdmmc_dtimer SDMMCDTIMER The SDMMC_DTIMER register contains the data timeout period, in card bus clock periods. A counter loads the value from the SDMMC_DTIMER register, and starts decrementing when the data path state machine (DPSM) enters the Wait_R or Busy state. If the timer reaches 0 while the DPSM is in either of these states, the timeout status flag is set.
@{*/


#define SDMMC2_SDMMC_DTIMER_DATATIME_SHIFT		0
#define SDMMC2_SDMMC_DTIMER_DATATIME_MASK		0xffffffff
/** @defgroup sdmmc2_sdmmc_dtimer_datatime DATATIME Data and R1b busy timeout period This bit can only be written when the CPSM and DPSM are not active (CPSMACT = 0 and DPSMACT = 0). Data and R1b busy timeout period expressed in card bus clock periods.
@{*/
/**@}*/


/**@}*/

/** @defgroup sdmmc2_sdmmc_dlenr SDMMCDLENR The SDMMC_DLENR register contains the number of data bytes to be transferred. The value is loaded into the data counter when data transfer starts.
@{*/


#define SDMMC2_SDMMC_DLENR_DATALENGTH_SHIFT		0
#define SDMMC2_SDMMC_DLENR_DATALENGTH_MASK		0x1ffffff
/** @defgroup sdmmc2_sdmmc_dlenr_datalength DATALENGTH Data length value This register can only be written by firmware when DPSM is inactive (DPSMACT = 0). Number of data bytes to be transferred. When DDR = 1 DATALENGTH is truncated to a multiple of 2. (The last odd byte is not transfered) When DATALENGTH = 0 no data will be transfered, when requested by a CPSMEN and CMDTRANS = 1 also no command will be transfered. DTEN and CPSMEN are cleared to 0.
@{*/
/**@}*/


/**@}*/

/** @defgroup sdmmc2_sdmmc_dctrl SDMMCDCTRL The SDMMC_DCTRL register control the data path state machine (DPSM).
@{*/

/** SDMMC2_SDMMC_DCTRL_FIFORST FIFO reset, will flush any remaining data. This bit can only be written by firmware when IDMAEN= 0 and DPSM is active (DPSMACT = 1). This bit will only take effect when a transfer error or transfer hold occurs. **/
#define SDMMC2_SDMMC_DCTRL_FIFORST		(1 << 13)
/** SDMMC2_SDMMC_DCTRL_BOOTACKEN Enable the reception of the boot acknowledgment. This bit can only be written by firmware when DPSM is inactive (DPSMACT = 0). **/
#define SDMMC2_SDMMC_DCTRL_BOOTACKEN		(1 << 12)
/** SDMMC2_SDMMC_DCTRL_SDIOEN SD I/O interrupt enable functions This bit can only be written by firmware when DPSM is inactive (DPSMACT = 0). If this bit is set, the DPSM enables the SD I/O card specific interrupt operation. **/
#define SDMMC2_SDMMC_DCTRL_SDIOEN		(1 << 11)
/** SDMMC2_SDMMC_DCTRL_RWMOD Read wait mode. This bit can only be written by firmware when DPSM is inactive (DPSMACT = 0). **/
#define SDMMC2_SDMMC_DCTRL_RWMOD		(1 << 10)
/** SDMMC2_SDMMC_DCTRL_RWSTOP Read wait stop This bit is written by firmware and auto cleared by hardware when the DPSM moves from the READ_WAIT state to the WAIT_R or IDLE state. **/
#define SDMMC2_SDMMC_DCTRL_RWSTOP		(1 << 9)
/** SDMMC2_SDMMC_DCTRL_RWSTART Read wait start. If this bit is set, read wait operation starts. **/
#define SDMMC2_SDMMC_DCTRL_RWSTART		(1 << 8)

#define SDMMC2_SDMMC_DCTRL_DBLOCKSIZE_SHIFT		4
#define SDMMC2_SDMMC_DCTRL_DBLOCKSIZE_MASK		0x0f
/** @defgroup sdmmc2_sdmmc_dctrl_dblocksize DBLOCKSIZE Data block size This bit can only be written by firmware when DPSM is inactive (DPSMACT = 0). Define the data block length when the block data transfer mode is selected: When DATALENGTH is not a multiple of DBLOCKSIZE, the transfered data is truncated at a multiple of DBLOCKSIZE. (Any remain data will not be transfered.) When DDR = 1, DBLOCKSIZE = 0000 shall not be used. (No data will be transfered)
@{*/
/**@}*/


#define SDMMC2_SDMMC_DCTRL_DTMODE_SHIFT		2
#define SDMMC2_SDMMC_DCTRL_DTMODE_MASK		0x03
/** @defgroup sdmmc2_sdmmc_dctrl_dtmode DTMODE Data transfer mode selection. This bit can only be written by firmware when DPSM is inactive (DPSMACT = 0).
@{*/
/**@}*/

/** SDMMC2_SDMMC_DCTRL_DTDIR Data transfer direction selection This bit can only be written by firmware when DPSM is inactive (DPSMACT = 0). **/
#define SDMMC2_SDMMC_DCTRL_DTDIR		(1 << 1)
/** SDMMC2_SDMMC_DCTRL_DTEN Data transfer enable bit This bit can only be written by firmware when DPSM is inactive (DPSMACT = 0). This bit is cleared by Hardware when data transfer completes. This bit shall only be used to transfer data when no associated data transfer command is used, i.e. shall not be used with SD or eMMC cards. **/
#define SDMMC2_SDMMC_DCTRL_DTEN		(1 << 0)

/**@}*/

/** @defgroup sdmmc2_sdmmc_dcntr SDMMCDCNTR The SDMMC_DCNTR register loads the value from the data length register (see SDMMC_DLENR) when the DPSM moves from the Idle state to the Wait_R or Wait_S state. As data is transferred, the counter decrements the value until it reaches 0. The DPSM then moves to the Idle state and when there has been no error, the data status end flag (DATAEND) is set.
@{*/


#define SDMMC2_SDMMC_DCNTR_DATACOUNT_SHIFT		0
#define SDMMC2_SDMMC_DCNTR_DATACOUNT_MASK		0x1ffffff
/** @defgroup sdmmc2_sdmmc_dcntr_datacount DATACOUNT Data count value When read, the number of remaining data bytes to be transferred is returned. Write has no effect.
@{*/
/**@}*/


/**@}*/

